/*
Descrption
1只公鸡值5文钱；1只母鸡值3文钱；3只小鸡值1文钱。

给定总钱数 M 与 需购买鸡的数量 N (0 < M, N <= 300)，要求钱恰好用完，请问公鸡、母鸡和小鸡各买几只？

按 [ 公鸡、母鸡、小鸡 ] 的顺序分别输出结果，一组解答占一行，解答按照公鸡数目从大到小排序（其次母鸡，再次小鸡）

无解时请输出 no answer

注意：钱要花完

Input
100 100

Ouput
12 4 84

8 11 81

4 18 78

0 25 75
*/
#include<stdio.h>
int main(){
	int M,N,C=0;
	scanf("%d%d",&M,&N);
	for(int X=N;X>=0;X--){
        if ((3 * M - 9 * N + 8 * X) % 6 == 0 && (3 * M - 9 * N + 8 * X) >= 0 && N - X - (3 * M - 9 * N + 8 * X) / 6 >= 0)
            printf("%d %d %d\n", (3 * M - 9 * N + 8 * X) / 6, N - X - (3 * M - 9 * N + 8 * X) / 6, X, C++);
    }
	if(!C)
        printf("no answer\n");
}